In [1]:
import pandas as pd
df = pd.read_csv('aug_train.csv')

In [2]:
print("=== 각 열의 결측치 개수 ===")
print(df.isnull().sum())

=== 각 열의 결측치 개수 ===
enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

In [3]:
m_value = df.isnull()
print(m_value)
print(m_value.sum())

       enrollee_id   city  city_development_index  gender  \
0            False  False                   False   False
1            False  False                   False   False
2            False  False                   False    True
3            False  False                   False    True
4            False  False                   False   False
...            ...    ...                     ...     ...
19153        False  False                   False   False
19154        False  False                   False   False
19155        False  False                   False   False
19156        False  False                   False   False
19157        False  False                   False    True

       relevent_experience  enrolled_university  education_level  \
0                    False                False            False
1                    False                False            False
2                    False                False            False
3                    False                 True            False
4                    False                False            False
...                    ...                  ...              ...
19153                False                False            False
19154                False                False            False
19155                False                False            False
19156                False                False            False
19157                False                False            False

       major_discipline  experience  company_size  company_type  last_new_job  \
0                 False       False          True          True         False
1                 False       False         False         False         False
2                 False       False          True          True         False
3                 False       False          True         False         False
4                 False       False         False         False         False
...                 ...         ...           ...           ...           ...
19153             False       False          True          True         False
19154             False       False          True          True         False
19155             False       False         False         False         False
19156              True       False         False         False         False
19157              True       False          True          True         False

       training_hours  target
0               False   False
1               False   False
2               False   False
3               False   False
4               False   False
...               ...     ...
19153           False   False
19154           False   False
19155           False   False
19156           False   False
19157           False   False

[19158 rows x 14 columns]
enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

In [4]:
missing_gender = df['gender'].isnull().sum()
print("성별 정보 결측치 수:" , missing_gender)

성별 정보 결측치 수: 4508

In [6]:
missing_experience = df['experience'].isna().sum()
print("근무 경력 결측치 수:", missing_experience)

근무 경력 결측치 수: 65

In [9]:
both_missing = df[df['gender'].isnull() & df['education_level'].isnull()]
print("성별과 교육 수준이 모두 결측치인 지원자 수:", len(both_missing))

성별과 교육 수준이 모두 결측치인 지원자 수: 201

In [10]:
print("원본 데이터프레임 크키:", df.shape)
df_dropna = df.dropna()
print("결측치 제거 후 데이터프레임 크키:", df_dropna.shape)

원본 데이터프레임 크키: (19158, 14)
결측치 제거 후 데이터프레임 크키: (8955, 14)

In [12]:
df_thresh = df.dropna(thresh=12)
print("임계값 적용 후 데이터프레임 크기:", df_thresh.shape)

임계값 적용 후 데이터프레임 크기: (16327, 14)

In [13]:
df_dropna_rows = df.dropna(axis=0, how='all')
print("원본 데이터프레임의 행 개수:", df.shape[0])
print("모든 값이 결측치인 행 제거 후 행 개수:", df_dropna_rows.shape[0])

원본 데이터프레임의 행 개수: 19158
모든 값이 결측치인 행 제거 후 행 개수: 19158

In [14]:
df_dropna_columns = df.dropna(axis=1, how='all')
print("원본 데이터프레임의 열 개수:", df.shape[1])
print("모든 값이 결측치인 열 제거 후 열 개수:", df_dropna_rows.shape[1])

원본 데이터프레임의 행 개수: 14
모든 값이 결측치인 행 제거 후 행 개수: 14

In [15]:
df_dropna_any = df.dropna(axis=0, how='any')
print("원본 데이터프레임의 행 개수:", df.shape[0])
print("결측치가 있는 행 제거 후 행 개수:", df_dropna_any.shape[0])
print("제거된 행의 수:", df.shape[0] - df_dropna_any.shape[0])

원본 데이터프레임의 행 개수: 19158
결측치가 있는 행 제거 후 행 개수: 8955
제거된 행의 수: 10203

In [17]:
missing_ratio = df['company_type'].isnull().sum() / len(df) * 100
print("company_type 열의 결측치 비율: {:.2f}%".format(missing_ratio))
df_drop_company_type = df.drop(columns=['company_type'])
print("열 제거 후 데이터프레임 크기: ", df_drop_company_type.shape)

company_type 열의 결측치 비율: 32.05%
열 제거 후 데이터프레임 크기:  (19158, 13)

In [19]:
df = pd.DataFrame({
    'A': [1, None, 3, None, 5],
    'B': [None, 2, None, 4, None]
})
print("원본 데이터프레임:")
print(df)

원본 데이터프레임:
     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  NaN
3  NaN  4.0
4  5.0  NaN

In [20]:
df_filled = df.fillna(0)
print("결측치를 0으로 대체한 데이터프레임:")
print(df_filled)

결측치를 0으로 대체한 데이터프레임:
     A    B
0  1.0  0.0
1  0.0  2.0
2  3.0  0.0
3  0.0  4.0
4  5.0  0.0

In [21]:
values = {'A': df['A'].mean(), 'B': df['B'].median()}
df_filled_columns = df.fillna(value=values)
print("열마다 다른 값으로 결측치를 대체한 데이터프레임:")
print(df_filled_columns)

열마다 다른 값으로 결측치를 대체한 데이터프레임:
     A    B
0  1.0  3.0
1  3.0  2.0
2  3.0  3.0
3  3.0  4.0
4  5.0  3.0

In [22]:
values = {'A': df['A'].mean(), 'B': df['B'].median()}
df_filled_columns_limit = df.fillna(value=values, limit=1)
print("대체 횟수를 1로 지정하고 열마다 다른 값으로 결측치를 대체한 데이터프레임:")
print(df_filled_columns_limit)

대체 횟수를 1로 지정하고 열마다 다른 값으로 결측치를 대체한 데이터프레임:
     A    B
0  1.0  3.0
1  3.0  2.0
2  3.0  NaN
3  NaN  4.0
4  5.0  NaN

In [23]:
df.fillna(0, inplace=True)
print("원본 데이터프레임을 수정해 결측치를 0으로 대체한 결과:")
print(df)

원본 데이터프레임을 수정해 결측치를 0으로 대체한 결과:
     A    B
0  1.0  0.0
1  0.0  2.0
2  3.0  0.0
3  0.0  4.0
4  5.0  0.0

In [24]:
import pandas as pd
df = pd.read_csv('aug_train.csv')
df['gender'] = df['gender'].fillna('Not Specified')
print("gender 열 결측치를 Not Specified로 대체한 데이터프레임:")
print(df['gender'].value_counts())

gender 열 결측치를 Not Specified로 대체한 데이터프레임:
gender
Male             13221
Not Specified     4508
Female            1238
Other              191
Name: count, dtype: int64

In [25]:
df['education_level'] = df['education_level'].fillna('Unknown')
print(df['education_level'].value_counts())

education_level
Graduate          11598
Masters            4361
High School        2017
Unknown             460
Phd                 414
Primary School      308
Name: count, dtype: int64

In [26]:
df['experience'] = df['experience'].fillna(0)
print("experience 열의 결측치를 0으로 대체한 데이터프레임:")
print(df['experience'].value_counts())

experience 열의 결측치를 0으로 대체한 데이터프레임:
experience
>20    3286
5      1430
4      1403
3      1354
6      1216
2      1127
7      1028
10      985
9       980
8       802
15      686
11      664
14      586
1       549
<1      522
16      508
12      494
13      399
17      342
19      304
18      280
20      148
0        65
Name: count, dtype: int64

In [8]:
import pandas as pd
df = pd.read_csv('aug_train.csv')
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [2]:
print("각 열의 데이터 타입:")
print(df.dtypes)

각 열의 데이터 타입:
enrollee_id                 int64
city                       object
city_development_index    float64
gender                     object
relevent_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
company_size               object
company_type               object
last_new_job               object
training_hours              int64
target                    float64
dtype: object

In [3]:
df['target'] = df['target'].astype(int)
print("\ntarget 열의 데이터 타팁 변환 후 확인:")
print(df.dtypes['target'])
df.head()

target 열의 데이터 타팁 변환 후 확인:
int64

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0

In [4]:
df = pd.DataFrame({
    '입사일': ['2022-01-01', '2023-05-12', '2021-09-30', '잘못된값']
})
print("원본 데이터프레임:")
print(df)
df['입사일'] = pd.to_datetime(df['입사일'], errors='coerce')
print("\n입사일 열을 날짜형으로 변환환 데이터프레임:")
print(df)
print(df.dtypes['입사일'])

원본 데이터프레임:
          입사일
0  2022-01-01
1  2023-05-12
2  2021-09-30
3        잘못된값

입사일 열을 날짜형으로 변환환 데이터프레임:
         입사일
0 2022-01-01
1 2023-05-12
2 2021-09-30
3        NaT
datetime64[ns]

In [9]:
df = pd.read_csv('aug_train.csv')
df = df.rename(columns={'city_development_index': 'dev_index', 'relevent_experience': 'relevant_exp'})
print("열 이름 변경 후:")
df.head()

열 이름 변경 후:

,enrollee_id,city,dev_index,gender,relevant_exp,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [10]:
df['training_level'] = 'Low'
df.loc[df['training_hours'] >= 40, 'training_level'] = 'High'
print("새로운 열 추가 후:")
print(df[['training_hours', 'training_level']].head())

새로운 열 추가 후:
   training_hours training_level
0              36            Low
1              47           High
2              83           High
3              52           High
4               8            Low

In [11]:
df_sorted = df.sort_values(by='training_hours', ascending=False)
print("training_hours 열 기준 내림차순 정렬 후 데이터프레임:")
print(df_sorted[['training_hours', 'enrollee_id']])

training_hours 열 기준 내림차순 정렬 후 데이터프레임:
       training_hours  enrollee_id
16785             336        26858
4397              336        27795
18458             336        32716
4117              336        14332
7121              336        10041
...               ...          ...
8836                1        26150
11722               1         4168
14051               1         8759
10146               1        31032
17849               1        12243

[19158 rows x 2 columns]

In [12]:
df_sorted = df.sort_values(by=['dev_index', 'training_hours'],
                           ascending=[True, False])
print("정렬 후 데이터프레임:")
print(df_sorted[['dev_index', 'training_hours']].head())

정렬 후 데이터프레임:
       dev_index  training_hours
16784      0.448             154
5265       0.448              86
7864       0.448              74
5010       0.448              73
15114      0.448              66

In [15]:
df.sort_values(by='dev_index', ascending=True, inplace=True)
print("원본 데이터프레임을 dev_index 열 기준 정렬 후:")
print(df[['dev_index', 'enrollee_id']].head())
df.head()

원본 데이터프레임을 dev_index 열 기준 정렬 후:
       dev_index  enrollee_id
13549      0.448        28317
5265       0.448        31194
10401      0.448        19463
14913      0.448         3891
16784      0.448        10486

,enrollee_id,city,dev_index,gender,relevant_exp,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,training_level
13549,28317,city_33,0.448,NaN,Has relevent experience,no_enrollment,Graduate,STEM,8,10/49,Pvt Ltd,2,14,0.0,Low
5265,31194,city_33,0.448,NaN,No relevent experience,NaN,High School,NaN,5,NaN,Pvt Ltd,never,86,1.0,High
10401,19463,city_33,0.448,Male,No relevent experience,no_enrollment,Graduate,STEM,5,10000+,Pvt Ltd,2,36,0.0,Low
14913,3891,city_33,0.448,Male,No relevent experience,Full time course,High School,NaN,4,NaN,NaN,never,31,0.0,Low
16784,10486,city_33,0.448,NaN,No relevent experience,Full time course,Graduate,Other,2,500-999,Public Sector,2,154,1.0,High

In [16]:
print(df)

       enrollee_id     city  dev_index  gender             relevant_exp  \
13549        28317  city_33      0.448     NaN  Has relevent experience
5265         31194  city_33      0.448     NaN   No relevent experience
10401        19463  city_33      0.448    Male   No relevent experience
14913         3891  city_33      0.448    Male   No relevent experience
16784        10486  city_33      0.448     NaN   No relevent experience
...            ...      ...        ...     ...                      ...
6432           726  city_98      0.949     NaN  Has relevent experience
18753        27407  city_98      0.949    Male  Has relevent experience
1680         10219  city_98      0.949  Female  Has relevent experience
17479        20047  city_98      0.949    Male  Has relevent experience
12844         8393  city_98      0.949    Male  Has relevent experience

      enrolled_university education_level major_discipline experience  \
13549       no_enrollment        Graduate             STEM          8
5265                  NaN     High School              NaN          5
10401       no_enrollment        Graduate             STEM          5
14913    Full time course     High School              NaN          4
16784    Full time course        Graduate            Other          2
...                   ...             ...              ...        ...
6432        no_enrollment         Masters             STEM         13
18753       no_enrollment        Graduate             STEM         11
1680        no_enrollment         Masters             STEM        >20
17479       no_enrollment        Graduate             STEM          6
12844       no_enrollment         Masters             STEM        >20

      company_size   company_type last_new_job  training_hours  target  \
13549        10/49        Pvt Ltd            2              14     0.0
5265           NaN        Pvt Ltd        never              86     1.0
10401       10000+        Pvt Ltd            2              36     0.0
14913          NaN            NaN        never              31     0.0
16784      500-999  Public Sector            2             154     1.0
...            ...            ...          ...             ...     ...
6432         10/49        Pvt Ltd            4              35     0.0
18753       10000+        Pvt Ltd            1              45     0.0
1680         50-99        Pvt Ltd            2             111     0.0
17479       10000+        Pvt Ltd            1              11     0.0
12844    1000-4999        Pvt Ltd            1              39     0.0

      training_level
13549            Low
5265            High
10401            Low
14913            Low
16784           High
...              ...
6432             Low
18753           High
1680            High
17479            Low
12844            Low

[19158 rows x 15 columns]

In [19]:
data = {'ID': [1, 2, 2, 3, 4, 4, 4],
        'Name': ['Alice', 'Bob', 'Bob', 'Charlie', 'David', 'David', 'David']}
df = pd.DataFrame(data)
df_unique = df.drop_duplicates(subset=['ID'], keep='first')
print("중복 제거 후:")
print(df_unique)

중복 제거 후:
   ID     Name
0   1    Alice
1   2      Bob
3   3  Charlie
4   4    David

In [21]:
data = {'ID': [1, 2, 3, 4, 5],
        'Age': [25, 30, 45, 100, 28]}
df = pd.DataFrame(data)
print(df.describe())
df_no_outliers = df[df['Age'] < 60 ]
print("\n이상치 제거 후:")
print(df_no_outliers)
median_age = df['Age'].median()
df.loc[df['Age'] >= 60, 'Age'] = median_age
print("\n이상치를 중앙값으로 대체한 후:")
print(df)

             ID         Age
count  5.000000    5.000000
mean   3.000000   45.600000
std    1.581139   31.373556
min    1.000000   25.000000
25%    2.000000   28.000000
50%    3.000000   30.000000
75%    4.000000   45.000000
max    5.000000  100.000000

이상치 제거 후:
   ID  Age
0   1   25
1   2   30
2   3   45
4   5   28

이상치를 중앙값으로 대체한 후:
   ID  Age
0   1   25
1   2   30
2   3   45
3   4   30
4   5   28

In [22]:
data = {'Name': [' Alice ', 'Bob', ' Charlie ', 'David ', ' Emma']}
df = pd.DataFrame(data)
df['Name'] = df['Name'].str.strip()
print("공백 제거 후:")
print(df)

공백 제거 후:
      Name
0    Alice
1      Bob
2  Charlie
3    David
4     Emma

In [23]:
df['Name'] = df['Name'].str.replace('Alice', 'Alicia')
print("특정 문자열 대체 후:")
print(df)

특정 문자열 대체 후:
      Name
0   Alicia
1      Bob
2  Charlie
3    David
4     Emma

In [25]:
df['Name'] = df['Name'].str.upper()
print("대문자로 변환 후:")
print(df)

대문자로 변환 후:
      Name
0   ALICIA
1      BOB
2  CHARLIE
3    DAVID
4     EMMA

In [26]:
df['Name'] = df['Name'].str.lower()
print("소문자로 변환 후:")
print(df)

소문자로 변환 후:
      Name
0   alicia
1      bob
2  charlie
3    david
4     emma

In [40]:
df = pd.read_csv('aug_train.csv')
print(df['experience'].head())

0    >20
1     15
2      5
3     <1
4    >20
Name: experience, dtype: object

In [41]:
df['experience'] = df['experience'].fillna('0')
print(df['experience'].head())
df['experience'] = df['experience'].str.replace('>', '').str.replace('<', '').astype(int)
print("숫자형으로 변환 후:")
print(df['experience'].head())

0    >20
1     15
2      5
3     <1
4    >20
Name: experience, dtype: object
숫자형으로 변환 후:
0    20
1    15
2     5
3     1
4    20
Name: experience, dtype: int64

In [42]:
data = {'salary': ['600,000', '750,000', '1,000,000']}
df = pd.DataFrame(data)
df['salary'] = df['salary'].str.replace(',', '').astype(int)
print("연봉 데이터 변환 후:")
print(df)

연봉 데이터 변환 후:
    salary
0   600000
1   750000
2  1000000

In [43]:
data = {'growth_rate': ['50%', '75%', '100%']}
df = pd.DataFrame(data)
df['growth_rate'] = df['growth_rate'].str.replace('%', '').astype(float) / 100
print("성장률 데이터 변환 후:")
print(df)

성장률 데이터 변환 후:
   growth_rate
0         0.50
1         0.75
2         1.00

In [44]:
import pandas as pd
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
})
df2 = pd.DataFrame({
    'ID': [4, 5],
    'Name': ['David', 'Emma'],
    'City': ['New York', 'Los Angeles']
})
df_concat = pd.concat([df1, df2], axis=0, ignore_index=True)
print("행 기준으로 연결 후(join='outer'):")
print(df_concat)

행 기준으로 연결 후(join='outer'):
   ID     Name   Age         City
0   1    Alice  25.0          NaN
1   2      Bob  30.0          NaN
2   3  Charlie  35.0          NaN
3   4    David   NaN     New York
4   5     Emma   NaN  Los Angeles

In [45]:
df_concat = pd.concat([df1, df2], axis=1)
print("열 기준으로 연결 후:")
print(df_concat)

열 기준으로 연결 후:
   ID     Name  Age   ID   Name         City
0   1    Alice   25  4.0  David     New York
1   2      Bob   30  5.0   Emma  Los Angeles
2   3  Charlie   35  NaN    NaN          NaN

In [46]:
df_concat = pd.concat([df1, df2], axis=0, join='inner', ignore_index=True)
print("행 기준으로 연결 후(join='outer'):")
print(df_concat)

행 기준으로 연결 후(join='outer'):
   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5     Emma

In [47]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})
df2 = pd.DataFrame({
    'ID': [1, 2, 4],
    'Score': [85, 90, 95]
})
df_inner = pd.merge(df1, df2, on='ID', how='inner')
print("Inner Join 결과:")
print(df_inner)

Inner Join 결과:
   ID   Name  Score
0   1  Alice     85
1   2    Bob     90

In [48]:
df_outer = pd.merge(df1, df2, on='ID', how='outer')
print("Outer Join 결과:")
print(df_outer)

Outer Join 결과:
   ID     Name  Score
0   1    Alice   85.0
1   2      Bob   90.0
2   3  Charlie    NaN
3   4      NaN   95.0

In [49]:
df_left = pd.merge(df1, df2, on='ID', how='left')
print("Left Join 결과:")
print(df_left)

Left Join 결과:
   ID     Name  Score
0   1    Alice   85.0
1   2      Bob   90.0
2   3  Charlie    NaN

In [50]:
df_right = pd.merge(df1, df2, on='ID', how='right')
print("Right Join 결과:")
print(df_right)

Right Join 결과:
   ID   Name  Score
0   1  Alice     85
1   2    Bob     90
2   4    NaN     95